# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

a = int (input('Введите номер дня недели от 1 до 7: '))
if a == 1:
    print('День не является выходным')
elif a == 2:
    print('День не является выходным')
elif a == 3:
    print('День не является выходным')
elif a == 4:
    print('День не является выходным')
elif a == 5:
    print('День не является выходным')
elif a == 6:
    print('День является выходным')
elif a == 7:
    print('День является выходным')
else:
    print('Ошибка ввода! Введите номмер дня недели от 1 до 7!')







